
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |    Change |    Destroy |
|:---------:|--------:|----------:|-----------:|
|     ✅     |      25 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                       |
|:--------:|:--------------------------------------------------------------------------------|
|    🟢     | `module.management.aws_default_route_table.default`                             |
|    🟢     | `module.management.aws_default_security_group.default`                          |
|    🟢     | `module.management.aws_eip.nat_eip["10.0.0.0/24"]`                              |
|    🟢     | `module.management.aws_eip.nat_eip["10.0.2.0/24"]`                              |
|    🟢     | `module.management.aws_internet_gateway.ig`                                     |
|    🟢     | `module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]`                       |
|    🟢     | `module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]`                       |
|    🟢     | `module.management.aws_route.default_main`                                      |
|    🟢     | `module.management.aws_route.subnet_private["10.0.1.0/24"]`                     |
|    🟢     | `module.management.aws_route.subnet_private["10.0.3.0/24"]`                     |
|    🟢     | `module.management.aws_route.subnet_public["10.0.0.0/24"]`                      |
|    🟢     | `module.management.aws_route.subnet_public["10.0.2.0/24"]`                      |
|    🟢     | `module.management.aws_route_table.all["10.0.0.0/24"]`                          |
|    🟢     | `module.management.aws_route_table.all["10.0.1.0/24"]`                          |
|    🟢     | `module.management.aws_route_table.all["10.0.2.0/24"]`                          |
|    🟢     | `module.management.aws_route_table.all["10.0.3.0/24"]`                          |
|    🟢     | `module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]` |
|    🟢     | `module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]` |
|    🟢     | `module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]` |
|    🟢     | `module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]` |
|    🟢     | `module.management.aws_subnet.all["10.0.0.0/24"]`                               |
|    🟢     | `module.management.aws_subnet.all["10.0.1.0/24"]`                               |
|    🟢     | `module.management.aws_subnet.all["10.0.2.0/24"]`                               |
|    🟢     | `module.management.aws_subnet.all["10.0.3.0/24"]`                               |
|    🟢     | `module.management.aws_vpc.vpc`                                                 |
|    🟢     | `data.aws_availability_zones.uw1:`                                              |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/a4292f2b-18aa-4b3c-bf2b-8138f309edaa/terraform-bin plan -no-color --out=tf.plan
data.aws_availability_zones.uw1: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...
data.aws_iam_policy.administrator-access: Reading...
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]
data.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]
data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.management.aws_default_route_table.default will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name"        = "Main table for 10.0.0.0/22"
          + "environment" = "production"
          + "residency"   = "10.0.0.0/22"
          + "service"     = "management"
        }
      + tags_all               = {
          + "Name"        = "Main table for 10.0.0.0/22"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "residency"   = "10.0.0.0/22"
          + "service"     = "management"
        }
      + vpc_id                 = (known after apply)
    }

  # module.management.aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "10.0.0.0/22 default"
          + "environment" = "production"
          + "service"     = "management"
        }
      + tags_all               = {
          + "Name"        = "10.0.0.0/22 default"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "service"     = "management"
        }
      + vpc_id                 = (known after apply)
    }

  # module.management.aws_eip.nat_eip["10.0.0.0/24"] will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "Elastic IP for NAT gateway"
          + "environment" = "production"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + tags_all             = {
          + "Name"        = "Elastic IP for NAT gateway"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + vpc                  = true
    }

  # module.management.aws_eip.nat_eip["10.0.2.0/24"] will be created
  + resource "aws_eip" "nat_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "Elastic IP for NAT gateway"
          + "environment" = "production"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + tags_all             = {
          + "Name"        = "Elastic IP for NAT gateway"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + vpc                  = true
    }

  # module.management.aws_internet_gateway.ig will be created
  + resource "aws_internet_gateway" "ig" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "Internet gateway"
          + "environment" = "production"
          + "service"     = "management"
        }
      + tags_all = {
          + "Name"        = "Internet gateway"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "service"     = "management"
        }
      + vpc_id   = (known after apply)
    }

  # module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"        = "NAT gateway"
          + "environment" = "production"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + tags_all             = {
          + "Name"        = "NAT gateway"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
    }

  # module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"        = "NAT gateway"
          + "environment" = "production"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + tags_all             = {
          + "Name"        = "NAT gateway"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
    }

  # module.management.aws_route.default_main will be created
  + resource "aws_route" "default_main" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route.subnet_private["10.0.1.0/24"] will be created
  + resource "aws_route" "subnet_private" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route.subnet_private["10.0.3.0/24"] will be created
  + resource "aws_route" "subnet_private" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route.subnet_public["10.0.0.0/24"] will be created
  + resource "aws_route" "subnet_public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route.subnet_public["10.0.2.0/24"] will be created
  + resource "aws_route" "subnet_public" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.management.aws_route_table.all["10.0.0.0/24"] will be created
  + resource "aws_route_table" "all" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Table for 10.0.0.0/24"
          + "environment" = "production"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + tags_all         = {
          + "Name"        = "Table for 10.0.0.0/24"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "residency"   = "10.0.0.0/24"
          + "service"     = "management"
        }
      + vpc_id           = (known after apply)
    }

  # module.management.aws_route_table.all["10.0.1.0/24"] will be created
  + resource "aws_route_table" "all" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Table for 10.0.1.0/24"
          + "environment" = "production"
          + "residency"   = "10.0.1.0/24"
          + "service"     = "management"
        }
      + tags_all         = {
          + "Name"        = "Table for 10.0.1.0/24"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "residency"   = "10.0.1.0/24"
          + "service"     = "management"
        }
      + vpc_id           = (known after apply)
    }

  # module.management.aws_route_table.all["10.0.2.0/24"] will be created
  + resource "aws_route_table" "all" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Table for 10.0.2.0/24"
          + "environment" = "production"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + tags_all         = {
          + "Name"        = "Table for 10.0.2.0/24"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "residency"   = "10.0.2.0/24"
          + "service"     = "management"
        }
      + vpc_id           = (known after apply)
    }

  # module.management.aws_route_table.all["10.0.3.0/24"] will be created
  + resource "aws_route_table" "all" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "Table for 10.0.3.0/24"
          + "environment" = "production"
          + "residency"   = "10.0.3.0/24"
          + "service"     = "management"
        }
      + tags_all         = {
          + "Name"        = "Table for 10.0.3.0/24"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "residency"   = "10.0.3.0/24"
          + "service"     = "management"
        }
      + vpc_id           = (known after apply)
    }

  # module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"] will be created
  + resource "aws_route_table_association" "private_rt_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"] will be created
  + resource "aws_route_table_association" "private_rt_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"] will be created
  + resource "aws_route_table_association" "private_rt_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"] will be created
  + resource "aws_route_table_association" "private_rt_assoc" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.management.aws_subnet.all["10.0.0.0/24"] will be created
  + resource "aws_subnet" "all" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "10.0.0.0/24"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                                       = {
          + "Name"        = "10.0.0.0/24"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.management.aws_subnet.all["10.0.1.0/24"] will be created
  + resource "aws_subnet" "all" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "10.0.1.0/24"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                                       = {
          + "Name"        = "10.0.1.0/24"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.management.aws_subnet.all["10.0.2.0/24"] will be created
  + resource "aws_subnet" "all" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "10.0.2.0/24"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                                       = {
          + "Name"        = "10.0.2.0/24"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.management.aws_subnet.all["10.0.3.0/24"] will be created
  + resource "aws_subnet" "all" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "10.0.3.0/24"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                                       = {
          + "Name"        = "10.0.3.0/24"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.management.aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/22"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = false
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "VPC 10.0.0.0/22"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
      + tags_all                             = {
          + "Name"        = "VPC 10.0.0.0/22"
          + "created_by"  = "infrahouse/aws-control-493370826424"
          + "environment" = "production"
          + "management"  = "true"
          + "service"     = "management"
        }
    }

Plan: 25 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_availability_zones.uw1: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Adata.aws_iam_policy.administrator-access: Read complete after 0s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.management.aws_default_route_table.default will be created%0A  + resource "aws_default_route_table" "default" {%0A      + arn                    = (known after apply)%0A      + default_route_table_id = (known after apply)%0A      + id                     = (known after apply)%0A      + owner_id               = (known after apply)%0A      + route                  = (known after apply)%0A      + tags                   = {%0A          + "Name"        = "Main table for 10.0.0.0/22"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.0.0/22"%0A          + "service"     = "management"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "Main table for 10.0.0.0/22"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.0.0/22"%0A          + "service"     = "management"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.management.aws_default_security_group.default will be created%0A  + resource "aws_default_security_group" "default" {%0A      + arn                    = (known after apply)%0A      + description            = (known after apply)%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + name                   = (known after apply)%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name"        = "10.0.0.0/22 default"%0A          + "environment" = "production"%0A          + "service"     = "management"%0A        }%0A      + tags_all               = {%0A          + "Name"        = "10.0.0.0/22 default"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "service"     = "management"%0A        }%0A      + vpc_id                 = (known after apply)%0A    }%0A%0A  # module.management.aws_eip.nat_eip["10.0.0.0/24"] will be created%0A  + resource "aws_eip" "nat_eip" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Name"        = "Elastic IP for NAT gateway"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.0.0/24"%0A          + "service"     = "management"%0A        }%0A      + tags_all             = {%0A          + "Name"        = "Elastic IP for NAT gateway"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.0.0/24"%0A          + "service"     = "management"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # module.management.aws_eip.nat_eip["10.0.2.0/24"] will be created%0A  + resource "aws_eip" "nat_eip" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "Name"        = "Elastic IP for NAT gateway"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.2.0/24"%0A          + "service"     = "management"%0A        }%0A      + tags_all             = {%0A          + "Name"        = "Elastic IP for NAT gateway"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.2.0/24"%0A          + "service"     = "management"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # module.management.aws_internet_gateway.ig will be created%0A  + resource "aws_internet_gateway" "ig" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "Name"        = "Internet gateway"%0A          + "environment" = "production"%0A          + "service"     = "management"%0A        }%0A      + tags_all = {%0A          + "Name"        = "Internet gateway"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "service"     = "management"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"] will be created%0A  + resource "aws_nat_gateway" "nat_gw" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Name"        = "NAT gateway"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.0.0/24"%0A          + "service"     = "management"%0A        }%0A      + tags_all             = {%0A          + "Name"        = "NAT gateway"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.0.0/24"%0A          + "service"     = "management"%0A        }%0A    }%0A%0A  # module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"] will be created%0A  + resource "aws_nat_gateway" "nat_gw" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + connectivity_type    = "public"%0A      + id                   = (known after apply)%0A      + network_interface_id = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + subnet_id            = (known after apply)%0A      + tags                 = {%0A          + "Name"        = "NAT gateway"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.2.0/24"%0A          + "service"     = "management"%0A        }%0A      + tags_all             = {%0A          + "Name"        = "NAT gateway"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.2.0/24"%0A          + "service"     = "management"%0A        }%0A    }%0A%0A  # module.management.aws_route.default_main will be created%0A  + resource "aws_route" "default_main" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # module.management.aws_route.subnet_private["10.0.1.0/24"] will be created%0A  + resource "aws_route" "subnet_private" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # module.management.aws_route.subnet_private["10.0.3.0/24"] will be created%0A  + resource "aws_route" "subnet_private" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + nat_gateway_id         = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # module.management.aws_route.subnet_public["10.0.0.0/24"] will be created%0A  + resource "aws_route" "subnet_public" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # module.management.aws_route.subnet_public["10.0.2.0/24"] will be created%0A  + resource "aws_route" "subnet_public" {%0A      + destination_cidr_block = "0.0.0.0/0"%0A      + gateway_id             = (known after apply)%0A      + id                     = (known after apply)%0A      + instance_id            = (known after apply)%0A      + instance_owner_id      = (known after apply)%0A      + network_interface_id   = (known after apply)%0A      + origin                 = (known after apply)%0A      + route_table_id         = (known after apply)%0A      + state                  = (known after apply)%0A    }%0A%0A  # module.management.aws_route_table.all["10.0.0.0/24"] will be created%0A  + resource "aws_route_table" "all" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name"        = "Table for 10.0.0.0/24"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.0.0/24"%0A          + "service"     = "management"%0A        }%0A      + tags_all         = {%0A          + "Name"        = "Table for 10.0.0.0/24"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.0.0/24"%0A          + "service"     = "management"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.management.aws_route_table.all["10.0.1.0/24"] will be created%0A  + resource "aws_route_table" "all" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name"        = "Table for 10.0.1.0/24"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.1.0/24"%0A          + "service"     = "management"%0A        }%0A      + tags_all         = {%0A          + "Name"        = "Table for 10.0.1.0/24"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.1.0/24"%0A          + "service"     = "management"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.management.aws_route_table.all["10.0.2.0/24"] will be created%0A  + resource "aws_route_table" "all" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name"        = "Table for 10.0.2.0/24"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.2.0/24"%0A          + "service"     = "management"%0A        }%0A      + tags_all         = {%0A          + "Name"        = "Table for 10.0.2.0/24"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.2.0/24"%0A          + "service"     = "management"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.management.aws_route_table.all["10.0.3.0/24"] will be created%0A  + resource "aws_route_table" "all" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = (known after apply)%0A      + tags             = {%0A          + "Name"        = "Table for 10.0.3.0/24"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.3.0/24"%0A          + "service"     = "management"%0A        }%0A      + tags_all         = {%0A          + "Name"        = "Table for 10.0.3.0/24"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "residency"   = "10.0.3.0/24"%0A          + "service"     = "management"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"] will be created%0A  + resource "aws_route_table_association" "private_rt_assoc" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"] will be created%0A  + resource "aws_route_table_association" "private_rt_assoc" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"] will be created%0A  + resource "aws_route_table_association" "private_rt_assoc" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"] will be created%0A  + resource "aws_route_table_association" "private_rt_assoc" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # module.management.aws_subnet.all["10.0.0.0/24"] will be created%0A  + resource "aws_subnet" "all" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-west-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.0.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"        = "10.0.0.0/24"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A      + tags_all                                       = {%0A          + "Name"        = "10.0.0.0/24"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.management.aws_subnet.all["10.0.1.0/24"] will be created%0A  + resource "aws_subnet" "all" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-west-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"        = "10.0.1.0/24"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A      + tags_all                                       = {%0A          + "Name"        = "10.0.1.0/24"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.management.aws_subnet.all["10.0.2.0/24"] will be created%0A  + resource "aws_subnet" "all" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-west-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = true%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"        = "10.0.2.0/24"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A      + tags_all                                       = {%0A          + "Name"        = "10.0.2.0/24"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.management.aws_subnet.all["10.0.3.0/24"] will be created%0A  + resource "aws_subnet" "all" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-west-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.0.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "Name"        = "10.0.3.0/24"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A      + tags_all                                       = {%0A          + "Name"        = "10.0.3.0/24"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # module.management.aws_vpc.vpc will be created%0A  + resource "aws_vpc" "vpc" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.0.0.0/22"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_classiclink                   = (known after apply)%0A      + enable_classiclink_dns_support       = (known after apply)%0A      + enable_dns_hostnames                 = false%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "Name"        = "VPC 10.0.0.0/22"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A      + tags_all                             = {%0A          + "Name"        = "VPC 10.0.0.0/22"%0A          + "created_by"  = "infrahouse/aws-control-493370826424"%0A          + "environment" = "production"%0A          + "management"  = "true"%0A          + "service"     = "management"%0A        }%0A    }%0A%0APlan: 25 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC9hNDI5MmYyYi0xOGFhLTRiM2MtYmYyYi04MTM4ZjMwOWVkYWEvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODk0MDY4ODI2XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zOTExODQ0ODY4XVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtZ2l0aHViXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM4MjkzNzE2OV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW5dXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLTIwMjMwNzA5MTY0MzIxMzE5OTAwMDAwMDAxXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc11cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICArIGNyZWF0ZVxuXG5UZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczpcblxuICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19kZWZhdWx0X3JvdXRlX3RhYmxlLmRlZmF1bHQgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfZGVmYXVsdF9yb3V0ZV90YWJsZVwiIFwiZGVmYXVsdFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGVmYXVsdF9yb3V0ZV90YWJsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3duZXJfaWQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm91dGUgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiTWFpbiB0YWJsZSBmb3IgMTAuMC4wLjAvMjJcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4wLjAvMjJcIlxuICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJNYWluIHRhYmxlIGZvciAxMC4wLjAuMC8yMlwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMC4wLzIyXCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9zZWN1cml0eV9ncm91cC5kZWZhdWx0IHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXBcIiBcImRlZmF1bHRcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlc2NyaXB0aW9uICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGVncmVzcyAgICAgICAgICAgICAgICAgPSBbXG4gICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICsgY2lkcl9ibG9ja3MgICAgICA9IFtcbiAgICAgICAgICAgICAgICAgICsgXCIwLjAuMC4wLzBcIixcbiAgICAgICAgICAgICAgICBdXG4gICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gICAgICA9IFwiXCJcbiAgICAgICAgICAgICAgKyBmcm9tX3BvcnQgICAgICAgID0gMFxuICAgICAgICAgICAgICArIGlwdjZfY2lkcl9ibG9ja3MgPSBbXVxuICAgICAgICAgICAgICArIHByZWZpeF9saXN0X2lkcyAgPSBbXVxuICAgICAgICAgICAgICArIHByb3RvY29sICAgICAgICAgPSBcIi0xXCJcbiAgICAgICAgICAgICAgKyBzZWN1cml0eV9ncm91cHMgID0gW11cbiAgICAgICAgICAgICAgKyBzZWxmICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICAgICAgICAgKyB0b19wb3J0ICAgICAgICAgID0gMFxuICAgICAgICAgICAgfSxcbiAgICAgICAgXVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpbmdyZXNzICAgICAgICAgICAgICAgID0gW1xuICAgICAgICAgICsge1xuICAgICAgICAgICAgICArIGNpZHJfYmxvY2tzICAgICAgPSBbXG4gICAgICAgICAgICAgICAgICArIFwiMC4wLjAuMC8wXCIsXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIGRlc2NyaXB0aW9uICAgICAgPSBcIlwiXG4gICAgICAgICAgICAgICsgZnJvbV9wb3J0ICAgICAgICA9IDBcbiAgICAgICAgICAgICAgKyBpcHY2X2NpZHJfYmxvY2tzID0gW11cbiAgICAgICAgICAgICAgKyBwcmVmaXhfbGlzdF9pZHMgID0gW11cbiAgICAgICAgICAgICAgKyBwcm90b2NvbCAgICAgICAgID0gXCItMVwiXG4gICAgICAgICAgICAgICsgc2VjdXJpdHlfZ3JvdXBzICA9IFtdXG4gICAgICAgICAgICAgICsgc2VsZiAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICAgICAgICAgICsgdG9fcG9ydCAgICAgICAgICA9IDBcbiAgICAgICAgICAgIH0sXG4gICAgICAgIF1cbiAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZV9wcmVmaXggICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3duZXJfaWQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcmV2b2tlX3J1bGVzX29uX2RlbGV0ZSA9IGZhbHNlXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuMC4wLzIyIGRlZmF1bHRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC4wLjAvMjIgZGVmYXVsdFwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4wLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfZWlwXCIgXCJuYXRfZWlwXCIge1xuICAgICAgKyBhbGxvY2F0aW9uX2lkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzb2NpYXRpb25faWQgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNhcnJpZXJfaXAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjdXN0b21lcl9vd25lZF9pcCAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZG9tYWluICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpbnN0YW5jZSAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmV0d29ya19ib3JkZXJfZ3JvdXAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5ldHdvcmtfaW50ZXJmYWNlICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlX2RucyAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZV9pcCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHB1YmxpY19kbnMgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwdWJsaWNfaXAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHVibGljX2lwdjRfcG9vbCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJFbGFzdGljIElQIGZvciBOQVQgZ2F0ZXdheVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjAuMC8yNFwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJFbGFzdGljIElQIGZvciBOQVQgZ2F0ZXdheVwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMC4wLzI0XCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjICAgICAgICAgICAgICAgICAgPSB0cnVlXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4yLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfZWlwXCIgXCJuYXRfZWlwXCIge1xuICAgICAgKyBhbGxvY2F0aW9uX2lkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzb2NpYXRpb25faWQgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNhcnJpZXJfaXAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjdXN0b21lcl9vd25lZF9pcCAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZG9tYWluICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpbnN0YW5jZSAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmV0d29ya19ib3JkZXJfZ3JvdXAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5ldHdvcmtfaW50ZXJmYWNlICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlX2RucyAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZV9pcCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHB1YmxpY19kbnMgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwdWJsaWNfaXAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHVibGljX2lwdjRfcG9vbCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJFbGFzdGljIElQIGZvciBOQVQgZ2F0ZXdheVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjIuMC8yNFwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJFbGFzdGljIElQIGZvciBOQVQgZ2F0ZXdheVwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMi4wLzI0XCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjICAgICAgICAgICAgICAgICAgPSB0cnVlXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2ludGVybmV0X2dhdGV3YXkuaWcgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaW50ZXJuZXRfZ2F0ZXdheVwiIFwiaWdcIiB7XG4gICAgICArIGFybiAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3duZXJfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJJbnRlcm5ldCBnYXRld2F5XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJJbnRlcm5ldCBnYXRld2F5XCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjX2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuMC4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX25hdF9nYXRld2F5XCIgXCJuYXRfZ3dcIiB7XG4gICAgICArIGFsbG9jYXRpb25faWQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3NvY2lhdGlvbl9pZCAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY29ubmVjdGl2aXR5X3R5cGUgICAgPSBcInB1YmxpY1wiXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuZXR3b3JrX2ludGVyZmFjZV9pZCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZV9pcCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHB1YmxpY19pcCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdWJuZXRfaWQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIk5BVCBnYXRld2F5XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMC4wLzI0XCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIk5BVCBnYXRld2F5XCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4wLjAvMjRcIlxuICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19uYXRfZ2F0ZXdheVwiIFwibmF0X2d3XCIge1xuICAgICAgKyBhbGxvY2F0aW9uX2lkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzb2NpYXRpb25faWQgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNvbm5lY3Rpdml0eV90eXBlICAgID0gXCJwdWJsaWNcIlxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmV0d29ya19pbnRlcmZhY2VfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByaXZhdGVfaXAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwdWJsaWNfaXAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3VibmV0X2lkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJOQVQgZ2F0ZXdheVwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjIuMC8yNFwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJOQVQgZ2F0ZXdheVwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMi4wLzI0XCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuZGVmYXVsdF9tYWluIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3JvdXRlXCIgXCJkZWZhdWx0X21haW5cIiB7XG4gICAgICArIGRlc3RpbmF0aW9uX2NpZHJfYmxvY2sgPSBcIjAuMC4wLjAvMFwiXG4gICAgICArIGdhdGV3YXlfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGluc3RhbmNlX2lkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGluc3RhbmNlX293bmVyX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5ldHdvcmtfaW50ZXJmYWNlX2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG9yaWdpbiAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvdXRlX3RhYmxlX2lkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0YXRlICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4xLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3Nfcm91dGVcIiBcInN1Ym5ldF9wcml2YXRlXCIge1xuICAgICAgKyBkZXN0aW5hdGlvbl9jaWRyX2Jsb2NrID0gXCIwLjAuMC4wLzBcIlxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpbnN0YW5jZV9pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpbnN0YW5jZV9vd25lcl9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuYXRfZ2F0ZXdheV9pZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuZXR3b3JrX2ludGVyZmFjZV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvcmlnaW4gICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb3V0ZV90YWJsZV9pZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdGF0ZSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMy4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3JvdXRlXCIgXCJzdWJuZXRfcHJpdmF0ZVwiIHtcbiAgICAgICsgZGVzdGluYXRpb25fY2lkcl9ibG9jayA9IFwiMC4wLjAuMC8wXCJcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaW5zdGFuY2VfaWQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaW5zdGFuY2Vfb3duZXJfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmF0X2dhdGV3YXlfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmV0d29ya19pbnRlcmZhY2VfaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3JpZ2luICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm91dGVfdGFibGVfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3RhdGUgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMC4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3JvdXRlXCIgXCJzdWJuZXRfcHVibGljXCIge1xuICAgICAgKyBkZXN0aW5hdGlvbl9jaWRyX2Jsb2NrID0gXCIwLjAuMC4wLzBcIlxuICAgICAgKyBnYXRld2F5X2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpbnN0YW5jZV9pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpbnN0YW5jZV9vd25lcl9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBuZXR3b3JrX2ludGVyZmFjZV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvcmlnaW4gICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb3V0ZV90YWJsZV9pZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdGF0ZSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC4yLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3Nfcm91dGVcIiBcInN1Ym5ldF9wdWJsaWNcIiB7XG4gICAgICArIGRlc3RpbmF0aW9uX2NpZHJfYmxvY2sgPSBcIjAuMC4wLjAvMFwiXG4gICAgICArIGdhdGV3YXlfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGluc3RhbmNlX2lkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGluc3RhbmNlX293bmVyX2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5ldHdvcmtfaW50ZXJmYWNlX2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG9yaWdpbiAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvdXRlX3RhYmxlX2lkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN0YXRlICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMC4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3JvdXRlX3RhYmxlXCIgXCJhbGxcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG93bmVyX2lkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByb3BhZ2F0aW5nX3Znd3MgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvdXRlICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIlRhYmxlIGZvciAxMC4wLjAuMC8yNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjAuMC8yNFwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIlRhYmxlIGZvciAxMC4wLjAuMC8yNFwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMC4wLzI0XCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjX2lkICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4xLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3Nfcm91dGVfdGFibGVcIiBcImFsbFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgb3duZXJfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJvcGFnYXRpbmdfdmd3cyA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm91dGUgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiVGFibGUgZm9yIDEwLjAuMS4wLzI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMS4wLzI0XCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiVGFibGUgZm9yIDEwLjAuMS4wLzI0XCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4xLjAvMjRcIlxuICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCJcbiAgICAgICAgfVxuICAgICAgKyB2cGNfaWQgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjIuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19yb3V0ZV90YWJsZVwiIFwiYWxsXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvd25lcl9pZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcm9wYWdhdGluZ192Z3dzID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb3V0ZSAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJUYWJsZSBmb3IgMTAuMC4yLjAvMjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4yLjAvMjRcIlxuICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJUYWJsZSBmb3IgMTAuMC4yLjAvMjRcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjIuMC8yNFwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHZwY19pZCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3JvdXRlX3RhYmxlXCIgXCJhbGxcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG93bmVyX2lkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHByb3BhZ2F0aW5nX3Znd3MgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvdXRlICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIlRhYmxlIGZvciAxMC4wLjMuMC8yNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjMuMC8yNFwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIlRhYmxlIGZvciAxMC4wLjMuMC8yNFwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMy4wLzI0XCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjX2lkICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMC4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uXCIgXCJwcml2YXRlX3J0X2Fzc29jXCIge1xuICAgICAgKyBpZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm91dGVfdGFibGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN1Ym5ldF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4xLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb25cIiBcInByaXZhdGVfcnRfYXNzb2NcIiB7XG4gICAgICArIGlkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByb3V0ZV90YWJsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc3VibmV0X2lkICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjIuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvblwiIFwicHJpdmF0ZV9ydF9hc3NvY1wiIHtcbiAgICAgICsgaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvdXRlX3RhYmxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBzdWJuZXRfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMy4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uXCIgXCJwcml2YXRlX3J0X2Fzc29jXCIge1xuICAgICAgKyBpZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcm91dGVfdGFibGVfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHN1Ym5ldF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4wLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3Nfc3VibmV0XCIgXCJhbGxcIiB7XG4gICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGFzc2lnbl9pcHY2X2FkZHJlc3Nfb25fY3JlYXRpb24gICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBhdmFpbGFiaWxpdHlfem9uZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJ1cy13ZXN0LTFhXCJcbiAgICAgICsgYXZhaWxhYmlsaXR5X3pvbmVfaWQgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgY2lkcl9ibG9jayAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiMTAuMC4wLjAvMjRcIlxuICAgICAgKyBlbmFibGVfZG5zNjQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgZW5hYmxlX3Jlc291cmNlX25hbWVfZG5zX2FfcmVjb3JkX29uX2xhdW5jaCAgICA9IGZhbHNlXG4gICAgICArIGVuYWJsZV9yZXNvdXJjZV9uYW1lX2Ruc19hYWFhX3JlY29yZF9vbl9sYXVuY2ggPSBmYWxzZVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcHY2X2NpZHJfYmxvY2tfYXNzb2NpYXRpb25faWQgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcHY2X25hdGl2ZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgbWFwX3B1YmxpY19pcF9vbl9sYXVuY2ggICAgICAgICAgICAgICAgICAgICAgICA9IHRydWVcbiAgICAgICsgb3duZXJfaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZV9kbnNfaG9zdG5hbWVfdHlwZV9vbl9sYXVuY2ggICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC4wLjAvMjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwibWFuYWdlbWVudFwiICA9IFwidHJ1ZVwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuMC4wLzI0XCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwibWFuYWdlbWVudFwiICA9IFwidHJ1ZVwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjEuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zdWJuZXRcIiBcImFsbFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzaWduX2lwdjZfYWRkcmVzc19vbl9jcmVhdGlvbiAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGF2YWlsYWJpbGl0eV96b25lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMWFcIlxuICAgICAgKyBhdmFpbGFiaWxpdHlfem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaWRyX2Jsb2NrICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCIxMC4wLjEuMC8yNFwiXG4gICAgICArIGVuYWJsZV9kbnM2NCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBlbmFibGVfcmVzb3VyY2VfbmFtZV9kbnNfYV9yZWNvcmRfb25fbGF1bmNoICAgID0gZmFsc2VcbiAgICAgICsgZW5hYmxlX3Jlc291cmNlX25hbWVfZG5zX2FhYWFfcmVjb3JkX29uX2xhdW5jaCA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlwdjZfY2lkcl9ibG9ja19hc3NvY2lhdGlvbl9pZCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlwdjZfbmF0aXZlICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBtYXBfcHVibGljX2lwX29uX2xhdW5jaCAgICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgb3duZXJfaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcHJpdmF0ZV9kbnNfaG9zdG5hbWVfdHlwZV9vbl9sYXVuY2ggICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC4xLjAvMjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwibWFuYWdlbWVudFwiICA9IFwidHJ1ZVwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuMS4wLzI0XCJcbiAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIlxuICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCJcbiAgICAgICAgICArIFwibWFuYWdlbWVudFwiICA9IFwidHJ1ZVwiXG4gICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIlxuICAgICAgICB9XG4gICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjIuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19zdWJuZXRcIiBcImFsbFwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYXNzaWduX2lwdjZfYWRkcmVzc19vbl9jcmVhdGlvbiAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGF2YWlsYWJpbGl0eV96b25lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMWNcIlxuICAgICAgKyBhdmFpbGFiaWxpdHlfem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaWRyX2Jsb2NrICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gXCIxMC4wLjIuMC8yNFwiXG4gICAgICArIGVuYWJsZV9kbnM2NCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBlbmFibGVfcmVzb3VyY2VfbmFtZV9kbnNfYV9yZWNvcmRfb25fbGF1bmNoICAgID0gZmFsc2VcbiAgICAgICsgZW5hYmxlX3Jlc291cmNlX25hbWVfZG5zX2FhYWFfcmVjb3JkX29uX2xhdW5jaCA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlwdjZfY2lkcl9ibG9ja19hc3NvY2lhdGlvbl9pZCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlwdjZfbmF0aXZlICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBtYXBfcHVibGljX2lwX29uX2xhdW5jaCAgICAgICAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlX2Ruc19ob3N0bmFtZV90eXBlX29uX2xhdW5jaCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjIuMC8yNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJtYW5hZ2VtZW50XCIgID0gXCJ0cnVlXCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC4yLjAvMjRcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJtYW5hZ2VtZW50XCIgID0gXCJ0cnVlXCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMy4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX3N1Ym5ldFwiIFwiYWxsXCIge1xuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhc3NpZ25faXB2Nl9hZGRyZXNzX29uX2NyZWF0aW9uICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgYXZhaWxhYmlsaXR5X3pvbmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXMtd2VzdC0xY1wiXG4gICAgICArIGF2YWlsYWJpbGl0eV96b25lX2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGNpZHJfYmxvY2sgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjEwLjAuMy4wLzI0XCJcbiAgICAgICsgZW5hYmxlX2RuczY0ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIGVuYWJsZV9yZXNvdXJjZV9uYW1lX2Ruc19hX3JlY29yZF9vbl9sYXVuY2ggICAgPSBmYWxzZVxuICAgICAgKyBlbmFibGVfcmVzb3VyY2VfbmFtZV9kbnNfYWFhYV9yZWNvcmRfb25fbGF1bmNoID0gZmFsc2VcbiAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaXB2Nl9jaWRyX2Jsb2NrX2Fzc29jaWF0aW9uX2lkICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaXB2Nl9uYXRpdmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlXG4gICAgICArIG1hcF9wdWJsaWNfaXBfb25fbGF1bmNoICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZVxuICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwcml2YXRlX2Ruc19ob3N0bmFtZV90eXBlX29uX2xhdW5jaCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0ge1xuICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjMuMC8yNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJtYW5hZ2VtZW50XCIgID0gXCJ0cnVlXCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC4zLjAvMjRcIlxuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiXG4gICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIlxuICAgICAgICAgICsgXCJtYW5hZ2VtZW50XCIgID0gXCJ0cnVlXCJcbiAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiXG4gICAgICAgIH1cbiAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cbiAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3NfdnBjLnZwYyB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c192cGNcIiBcInZwY1wiIHtcbiAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBjaWRyX2Jsb2NrICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjEwLjAuMC4wLzIyXCJcbiAgICAgICsgZGVmYXVsdF9uZXR3b3JrX2FjbF9pZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBkZWZhdWx0X3JvdXRlX3RhYmxlX2lkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGRlZmF1bHRfc2VjdXJpdHlfZ3JvdXBfaWQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZGhjcF9vcHRpb25zX2lkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBlbmFibGVfY2xhc3NpY2xpbmsgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGVuYWJsZV9jbGFzc2ljbGlua19kbnNfc3VwcG9ydCAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZW5hYmxlX2Ruc19ob3N0bmFtZXMgICAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgZW5hYmxlX2Ruc19zdXBwb3J0ICAgICAgICAgICAgICAgICAgID0gdHJ1ZVxuICAgICAgKyBlbmFibGVfbmV0d29ya19hZGRyZXNzX3VzYWdlX21ldHJpY3MgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaW5zdGFuY2VfdGVuYW5jeSAgICAgICAgICAgICAgICAgICAgID0gXCJkZWZhdWx0XCJcbiAgICAgICsgaXB2Nl9hc3NvY2lhdGlvbl9pZCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpcHY2X2NpZHJfYmxvY2sgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGlwdjZfY2lkcl9ibG9ja19uZXR3b3JrX2JvcmRlcl9ncm91cCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbWFpbl9yb3V0ZV90YWJsZV9pZCAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHtcbiAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiVlBDIDEwLjAuMC4wLzIyXCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcIm1hbmFnZW1lbnRcIiAgPSBcInRydWVcIlxuICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCJcbiAgICAgICAgfVxuICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7XG4gICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIlZQQyAxMC4wLjAuMC8yMlwiXG4gICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCJcbiAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiXG4gICAgICAgICAgKyBcIm1hbmFnZW1lbnRcIiAgPSBcInRydWVcIlxuICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCJcbiAgICAgICAgfVxuICAgIH1cblxuUGxhbjogMjUgdG8gYWRkLCAwIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5cdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcblxuU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW5cblxuVG8gcGVyZm9ybSBleGFjdGx5IHRoZXNlIGFjdGlvbnMsIHJ1biB0aGUgZm9sbG93aW5nIGNvbW1hbmQgdG8gYXBwbHk6XG4gICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiXG5SZWxlYXNpbmcgc3RhdGUgbG9jay4gVGhpcyBtYXkgdGFrZSBhIGZldyBtb21lbnRzLi4uXG46OmRlYnVnOjpUZXJyYWZvcm0gZXhpdGVkIHdpdGggY29kZSAwLlxuOjpkZWJ1Zzo6c3Rkb3V0OiBkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM4OTQwNjg4MjZdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEzODI5MzcxNjldJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbl0lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4tMjAyMzA3MDkxNjQzMjEzMTk5MDAwMDAwMDFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfZGVmYXVsdF9yb3V0ZV90YWJsZVwiIFwiZGVmYXVsdFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZWZhdWx0X3JvdXRlX3RhYmxlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG93bmVyX2lkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb3V0ZSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIk1haW4gdGFibGUgZm9yIDEwLjAuMC4wLzIyXCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4wLjAvMjJcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiTWFpbiB0YWJsZSBmb3IgMTAuMC4wLjAvMjJcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjAuMC8yMlwiJTBBICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCIlMEEgICAgICAgIH0lMEEgICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdCB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfZGVmYXVsdF9zZWN1cml0eV9ncm91cFwiIFwiZGVmYXVsdFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkZXNjcmlwdGlvbiAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZWdyZXNzICAgICAgICAgICAgICAgICA9IFslMEEgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICArIGNpZHJfYmxvY2tzICAgICAgPSBbJTBBICAgICAgICAgICAgICAgICAgKyBcIjAuMC4wLjAvMFwiLCUwQSAgICAgICAgICAgICAgICBdJTBBICAgICAgICAgICAgICArIGRlc2NyaXB0aW9uICAgICAgPSBcIlwiJTBBICAgICAgICAgICAgICArIGZyb21fcG9ydCAgICAgICAgPSAwJTBBICAgICAgICAgICAgICArIGlwdjZfY2lkcl9ibG9ja3MgPSBbXSUwQSAgICAgICAgICAgICAgKyBwcmVmaXhfbGlzdF9pZHMgID0gW10lMEEgICAgICAgICAgICAgICsgcHJvdG9jb2wgICAgICAgICA9IFwiLTFcIiUwQSAgICAgICAgICAgICAgKyBzZWN1cml0eV9ncm91cHMgID0gW10lMEEgICAgICAgICAgICAgICsgc2VsZiAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgICAgICAgICArIHRvX3BvcnQgICAgICAgICAgPSAwJTBBICAgICAgICAgICAgfSwlMEEgICAgICAgIF0lMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbmdyZXNzICAgICAgICAgICAgICAgID0gWyUwQSAgICAgICAgICArIHslMEEgICAgICAgICAgICAgICsgY2lkcl9ibG9ja3MgICAgICA9IFslMEEgICAgICAgICAgICAgICAgICArIFwiMC4wLjAuMC8wXCIsJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgZGVzY3JpcHRpb24gICAgICA9IFwiXCIlMEEgICAgICAgICAgICAgICsgZnJvbV9wb3J0ICAgICAgICA9IDAlMEEgICAgICAgICAgICAgICsgaXB2Nl9jaWRyX2Jsb2NrcyA9IFtdJTBBICAgICAgICAgICAgICArIHByZWZpeF9saXN0X2lkcyAgPSBbXSUwQSAgICAgICAgICAgICAgKyBwcm90b2NvbCAgICAgICAgID0gXCItMVwiJTBBICAgICAgICAgICAgICArIHNlY3VyaXR5X2dyb3VwcyAgPSBbXSUwQSAgICAgICAgICAgICAgKyBzZWxmICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICAgICAgICAgICsgdG9fcG9ydCAgICAgICAgICA9IDAlMEEgICAgICAgICAgICB9LCUwQSAgICAgICAgXSUwQSAgICAgICsgbmFtZSAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWVfcHJlZml4ICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcmV2b2tlX3J1bGVzX29uX2RlbGV0ZSA9IGZhbHNlJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC4wLjAvMjIgZGVmYXVsdFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuMC4wLzIyIGRlZmF1bHRcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCIlMEEgICAgICAgIH0lMEEgICAgICArIHZwY19pZCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4wLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2VpcFwiIFwibmF0X2VpcFwiIHslMEEgICAgICArIGFsbG9jYXRpb25faWQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzb2NpYXRpb25faWQgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjYXJyaWVyX2lwICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGN1c3RvbWVyX293bmVkX2lwICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZG9tYWluICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGluc3RhbmNlICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmV0d29ya19ib3JkZXJfZ3JvdXAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuZXR3b3JrX2ludGVyZmFjZSAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByaXZhdGVfZG5zICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZV9pcCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwdWJsaWNfZG5zICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHB1YmxpY19pcCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHVibGljX2lwdjRfcG9vbCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIkVsYXN0aWMgSVAgZm9yIE5BVCBnYXRld2F5XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4wLjAvMjRcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIkVsYXN0aWMgSVAgZm9yIE5BVCBnYXRld2F5XCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4wLjAvMjRcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB2cGMgICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjIuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfZWlwXCIgXCJuYXRfZWlwXCIgeyUwQSAgICAgICsgYWxsb2NhdGlvbl9pZCAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhc3NvY2lhdGlvbl9pZCAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNhcnJpZXJfaXAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY3VzdG9tZXJfb3duZWRfaXAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBkb21haW4gICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaW5zdGFuY2UgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuZXR3b3JrX2JvcmRlcl9ncm91cCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5ldHdvcmtfaW50ZXJmYWNlICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZV9kbnMgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcml2YXRlX2lwICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHB1YmxpY19kbnMgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHVibGljX2lwICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwdWJsaWNfaXB2NF9wb29sICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiRWxhc3RpYyBJUCBmb3IgTkFUIGdhdGV3YXlcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjIuMC8yNFwiJTBBICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiRWxhc3RpYyBJUCBmb3IgTkFUIGdhdGV3YXlcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjIuMC8yNFwiJTBBICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCIlMEEgICAgICAgIH0lMEEgICAgICArIHZwYyAgICAgICAgICAgICAgICAgID0gdHJ1ZSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19pbnRlcm5ldF9nYXRld2F5LmlnIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pbnRlcm5ldF9nYXRld2F5XCIgXCJpZ1wiIHslMEEgICAgICArIGFybiAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvd25lcl9pZCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiSW50ZXJuZXQgZ2F0ZXdheVwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJJbnRlcm5ldCBnYXRld2F5XCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB2cGNfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3NfbmF0X2dhdGV3YXkubmF0X2d3W1wiMTAuMC4wLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX25hdF9nYXRld2F5XCIgXCJuYXRfZ3dcIiB7JTBBICAgICAgKyBhbGxvY2F0aW9uX2lkICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFzc29jaWF0aW9uX2lkICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY29ubmVjdGl2aXR5X3R5cGUgICAgPSBcInB1YmxpY1wiJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5ldHdvcmtfaW50ZXJmYWNlX2lkID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZV9pcCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwdWJsaWNfaXAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN1Ym5ldF9pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJOQVQgZ2F0ZXdheVwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMC4wLzI0XCIlMEEgICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJOQVQgZ2F0ZXdheVwiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMC4wLzI0XCIlMEEgICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIiUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfbmF0X2dhdGV3YXlcIiBcIm5hdF9nd1wiIHslMEEgICAgICArIGFsbG9jYXRpb25faWQgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXNzb2NpYXRpb25faWQgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBjb25uZWN0aXZpdHlfdHlwZSAgICA9IFwicHVibGljXCIlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmV0d29ya19pbnRlcmZhY2VfaWQgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcml2YXRlX2lwICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHB1YmxpY19pcCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3VibmV0X2lkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIk5BVCBnYXRld2F5XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4yLjAvMjRcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIk5BVCBnYXRld2F5XCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4yLjAvMjRcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLmRlZmF1bHRfbWFpbiB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3Nfcm91dGVcIiBcImRlZmF1bHRfbWFpblwiIHslMEEgICAgICArIGRlc3RpbmF0aW9uX2NpZHJfYmxvY2sgPSBcIjAuMC4wLjAvMFwiJTBBICAgICAgKyBnYXRld2F5X2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGluc3RhbmNlX2lkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbnN0YW5jZV9vd25lcl9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmV0d29ya19pbnRlcmZhY2VfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG9yaWdpbiAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb3V0ZV90YWJsZV9pZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc3RhdGUgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjEuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3Nfcm91dGVcIiBcInN1Ym5ldF9wcml2YXRlXCIgeyUwQSAgICAgICsgZGVzdGluYXRpb25fY2lkcl9ibG9jayA9IFwiMC4wLjAuMC8wXCIlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbnN0YW5jZV9pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaW5zdGFuY2Vfb3duZXJfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hdF9nYXRld2F5X2lkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBuZXR3b3JrX2ludGVyZmFjZV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3JpZ2luICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJvdXRlX3RhYmxlX2lkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBzdGF0ZSAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMy4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19yb3V0ZVwiIFwic3VibmV0X3ByaXZhdGVcIiB7JTBBICAgICAgKyBkZXN0aW5hdGlvbl9jaWRyX2Jsb2NrID0gXCIwLjAuMC4wLzBcIiUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGluc3RhbmNlX2lkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbnN0YW5jZV9vd25lcl9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmF0X2dhdGV3YXlfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5ldHdvcmtfaW50ZXJmYWNlX2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvcmlnaW4gICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm91dGVfdGFibGVfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0YXRlICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjAuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3Nfcm91dGVcIiBcInN1Ym5ldF9wdWJsaWNcIiB7JTBBICAgICAgKyBkZXN0aW5hdGlvbl9jaWRyX2Jsb2NrID0gXCIwLjAuMC4wLzBcIiUwQSAgICAgICsgZ2F0ZXdheV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbnN0YW5jZV9pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaW5zdGFuY2Vfb3duZXJfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5ldHdvcmtfaW50ZXJmYWNlX2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvcmlnaW4gICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm91dGVfdGFibGVfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0YXRlICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjIuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3Nfcm91dGVcIiBcInN1Ym5ldF9wdWJsaWNcIiB7JTBBICAgICAgKyBkZXN0aW5hdGlvbl9jaWRyX2Jsb2NrID0gXCIwLjAuMC4wLzBcIiUwQSAgICAgICsgZ2F0ZXdheV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpbnN0YW5jZV9pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaW5zdGFuY2Vfb3duZXJfaWQgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5ldHdvcmtfaW50ZXJmYWNlX2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvcmlnaW4gICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm91dGVfdGFibGVfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN0YXRlICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMC4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19yb3V0ZV90YWJsZVwiIFwiYWxsXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvd25lcl9pZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJvcGFnYXRpbmdfdmd3cyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJvdXRlICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiVGFibGUgZm9yIDEwLjAuMC4wLzI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4wLjAvMjRcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiVGFibGUgZm9yIDEwLjAuMC4wLzI0XCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4wLjAvMjRcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB2cGNfaWQgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjEuMC8yNFwiXSB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3Nfcm91dGVfdGFibGVcIiBcImFsbFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3duZXJfaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHByb3BhZ2F0aW5nX3Znd3MgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb3V0ZSAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIlRhYmxlIGZvciAxMC4wLjEuMC8yNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMS4wLzI0XCIlMEEgICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIlRhYmxlIGZvciAxMC4wLjEuMC8yNFwiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcInJlc2lkZW5jeVwiICAgPSBcIjEwLjAuMS4wLzI0XCIlMEEgICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdnBjX2lkICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4yLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3JvdXRlX3RhYmxlXCIgXCJhbGxcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG93bmVyX2lkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcm9wYWdhdGluZ192Z3dzID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcm91dGUgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJUYWJsZSBmb3IgMTAuMC4yLjAvMjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjIuMC8yNFwiJTBBICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJUYWJsZSBmb3IgMTAuMC4yLjAvMjRcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICAgICsgXCJyZXNpZGVuY3lcIiAgID0gXCIxMC4wLjIuMC8yNFwiJTBBICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCIlMEEgICAgICAgIH0lMEEgICAgICArIHZwY19pZCAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19yb3V0ZV90YWJsZVwiIFwiYWxsXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvd25lcl9pZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJvcGFnYXRpbmdfdmd3cyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJvdXRlICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiVGFibGUgZm9yIDEwLjAuMy4wLzI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4zLjAvMjRcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiVGFibGUgZm9yIDEwLjAuMy4wLzI0XCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwicmVzaWRlbmN5XCIgICA9IFwiMTAuMC4zLjAvMjRcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB2cGNfaWQgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4wLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uXCIgXCJwcml2YXRlX3J0X2Fzc29jXCIgeyUwQSAgICAgICsgaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb3V0ZV90YWJsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN1Ym5ldF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4xLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uXCIgXCJwcml2YXRlX3J0X2Fzc29jXCIgeyUwQSAgICAgICsgaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb3V0ZV90YWJsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN1Ym5ldF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4yLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uXCIgXCJwcml2YXRlX3J0X2Fzc29jXCIgeyUwQSAgICAgICsgaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb3V0ZV90YWJsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN1Ym5ldF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4zLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uXCIgXCJwcml2YXRlX3J0X2Fzc29jXCIgeyUwQSAgICAgICsgaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb3V0ZV90YWJsZV9pZCA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHN1Ym5ldF9pZCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4wLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3N1Ym5ldFwiIFwiYWxsXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFzc2lnbl9pcHY2X2FkZHJlc3Nfb25fY3JlYXRpb24gICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgYXZhaWxhYmlsaXR5X3pvbmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXMtd2VzdC0xYVwiJTBBICAgICAgKyBhdmFpbGFiaWxpdHlfem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2lkcl9ibG9jayAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiMTAuMC4wLjAvMjRcIiUwQSAgICAgICsgZW5hYmxlX2RuczY0ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBlbmFibGVfcmVzb3VyY2VfbmFtZV9kbnNfYV9yZWNvcmRfb25fbGF1bmNoICAgID0gZmFsc2UlMEEgICAgICArIGVuYWJsZV9yZXNvdXJjZV9uYW1lX2Ruc19hYWFhX3JlY29yZF9vbl9sYXVuY2ggPSBmYWxzZSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlwdjZfY2lkcl9ibG9ja19hc3NvY2lhdGlvbl9pZCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcHY2X25hdGl2ZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIG1hcF9wdWJsaWNfaXBfb25fbGF1bmNoICAgICAgICAgICAgICAgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZV9kbnNfaG9zdG5hbWVfdHlwZV9vbl9sYXVuY2ggICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjAuMC8yNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcIm1hbmFnZW1lbnRcIiAgPSBcInRydWVcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC4wLjAvMjRcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICAgICsgXCJtYW5hZ2VtZW50XCIgID0gXCJ0cnVlXCIlMEEgICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMS4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zdWJuZXRcIiBcImFsbFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhc3NpZ25faXB2Nl9hZGRyZXNzX29uX2NyZWF0aW9uICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGF2YWlsYWJpbGl0eV96b25lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMWFcIiUwQSAgICAgICsgYXZhaWxhYmlsaXR5X3pvbmVfaWQgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNpZHJfYmxvY2sgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjEwLjAuMS4wLzI0XCIlMEEgICAgICArIGVuYWJsZV9kbnM2NCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgZW5hYmxlX3Jlc291cmNlX25hbWVfZG5zX2FfcmVjb3JkX29uX2xhdW5jaCAgICA9IGZhbHNlJTBBICAgICAgKyBlbmFibGVfcmVzb3VyY2VfbmFtZV9kbnNfYWFhYV9yZWNvcmRfb25fbGF1bmNoID0gZmFsc2UlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcHY2X2NpZHJfYmxvY2tfYXNzb2NpYXRpb25faWQgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXB2Nl9uYXRpdmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBtYXBfcHVibGljX2lwX29uX2xhdW5jaCAgICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIG93bmVyX2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcml2YXRlX2Ruc19ob3N0bmFtZV90eXBlX29uX2xhdW5jaCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuMS4wLzI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwibWFuYWdlbWVudFwiICA9IFwidHJ1ZVwiJTBBICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjEuMC8yNFwiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcIm1hbmFnZW1lbnRcIiAgPSBcInRydWVcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB2cGNfaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4yLjAvMjRcIl0gd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3N1Ym5ldFwiIFwiYWxsXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGFzc2lnbl9pcHY2X2FkZHJlc3Nfb25fY3JlYXRpb24gICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgYXZhaWxhYmlsaXR5X3pvbmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXMtd2VzdC0xY1wiJTBBICAgICAgKyBhdmFpbGFiaWxpdHlfem9uZV9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgY2lkcl9ibG9jayAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiMTAuMC4yLjAvMjRcIiUwQSAgICAgICsgZW5hYmxlX2RuczY0ICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBlbmFibGVfcmVzb3VyY2VfbmFtZV9kbnNfYV9yZWNvcmRfb25fbGF1bmNoICAgID0gZmFsc2UlMEEgICAgICArIGVuYWJsZV9yZXNvdXJjZV9uYW1lX2Ruc19hYWFhX3JlY29yZF9vbl9sYXVuY2ggPSBmYWxzZSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlwdjZfY2lkcl9ibG9ja19hc3NvY2lhdGlvbl9pZCAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcHY2X25hdGl2ZSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIG1hcF9wdWJsaWNfaXBfb25fbGF1bmNoICAgICAgICAgICAgICAgICAgICAgICAgPSB0cnVlJTBBICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcHJpdmF0ZV9kbnNfaG9zdG5hbWVfdHlwZV9vbl9sYXVuY2ggICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3MgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjIuMC8yNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcIm1hbmFnZW1lbnRcIiAgPSBcInRydWVcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB0YWdzX2FsbCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiMTAuMC4yLjAvMjRcIiUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiICA9IFwiaW5mcmFob3VzZS9hd3MtY29udHJvbC00OTMzNzA4MjY0MjRcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICAgICsgXCJtYW5hZ2VtZW50XCIgID0gXCJ0cnVlXCIlMEEgICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdnBjX2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMy4wLzI0XCJdIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19zdWJuZXRcIiBcImFsbFwiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBhc3NpZ25faXB2Nl9hZGRyZXNzX29uX2NyZWF0aW9uICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGF2YWlsYWJpbGl0eV96b25lICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcInVzLXdlc3QtMWNcIiUwQSAgICAgICsgYXZhaWxhYmlsaXR5X3pvbmVfaWQgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNpZHJfYmxvY2sgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjEwLjAuMy4wLzI0XCIlMEEgICAgICArIGVuYWJsZV9kbnM2NCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSBmYWxzZSUwQSAgICAgICsgZW5hYmxlX3Jlc291cmNlX25hbWVfZG5zX2FfcmVjb3JkX29uX2xhdW5jaCAgICA9IGZhbHNlJTBBICAgICAgKyBlbmFibGVfcmVzb3VyY2VfbmFtZV9kbnNfYWFhYV9yZWNvcmRfb25fbGF1bmNoID0gZmFsc2UlMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcHY2X2NpZHJfYmxvY2tfYXNzb2NpYXRpb25faWQgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaXB2Nl9uYXRpdmUgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IGZhbHNlJTBBICAgICAgKyBtYXBfcHVibGljX2lwX29uX2xhdW5jaCAgICAgICAgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIG93bmVyX2lkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwcml2YXRlX2Ruc19ob3N0bmFtZV90eXBlX29uX2xhdW5jaCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFncyAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IHslMEEgICAgICAgICAgKyBcIk5hbWVcIiAgICAgICAgPSBcIjEwLjAuMy4wLzI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwibWFuYWdlbWVudFwiICA9IFwidHJ1ZVwiJTBBICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCIlMEEgICAgICAgIH0lMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCIxMC4wLjMuMC8yNFwiJTBBICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTQ5MzM3MDgyNjQyNFwiJTBBICAgICAgICAgICsgXCJlbnZpcm9ubWVudFwiID0gXCJwcm9kdWN0aW9uXCIlMEEgICAgICAgICAgKyBcIm1hbmFnZW1lbnRcIiAgPSBcInRydWVcIiUwQSAgICAgICAgICArIFwic2VydmljZVwiICAgICA9IFwibWFuYWdlbWVudFwiJTBBICAgICAgICB9JTBBICAgICAgKyB2cGNfaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGMudnBjIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c192cGNcIiBcInZwY1wiIHslMEEgICAgICArIGFybiAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGNpZHJfYmxvY2sgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwiMTAuMC4wLjAvMjJcIiUwQSAgICAgICsgZGVmYXVsdF9uZXR3b3JrX2FjbF9pZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVmYXVsdF9yb3V0ZV90YWJsZV9pZCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGVmYXVsdF9zZWN1cml0eV9ncm91cF9pZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZGhjcF9vcHRpb25zX2lkICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5hYmxlX2NsYXNzaWNsaW5rICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5hYmxlX2NsYXNzaWNsaW5rX2Ruc19zdXBwb3J0ICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5hYmxlX2Ruc19ob3N0bmFtZXMgICAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGVuYWJsZV9kbnNfc3VwcG9ydCAgICAgICAgICAgICAgICAgICA9IHRydWUlMEEgICAgICArIGVuYWJsZV9uZXR3b3JrX2FkZHJlc3NfdXNhZ2VfbWV0cmljcyA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGluc3RhbmNlX3RlbmFuY3kgICAgICAgICAgICAgICAgICAgICA9IFwiZGVmYXVsdFwiJTBBICAgICAgKyBpcHY2X2Fzc29jaWF0aW9uX2lkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcHY2X2NpZHJfYmxvY2sgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpcHY2X2NpZHJfYmxvY2tfbmV0d29ya19ib3JkZXJfZ3JvdXAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBtYWluX3JvdXRlX3RhYmxlX2lkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvd25lcl9pZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7JTBBICAgICAgICAgICsgXCJOYW1lXCIgICAgICAgID0gXCJWUEMgMTAuMC4wLjAvMjJcIiUwQSAgICAgICAgICArIFwiZW52aXJvbm1lbnRcIiA9IFwicHJvZHVjdGlvblwiJTBBICAgICAgICAgICsgXCJtYW5hZ2VtZW50XCIgID0gXCJ0cnVlXCIlMEEgICAgICAgICAgKyBcInNlcnZpY2VcIiAgICAgPSBcIm1hbmFnZW1lbnRcIiUwQSAgICAgICAgfSUwQSAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0geyUwQSAgICAgICAgICArIFwiTmFtZVwiICAgICAgICA9IFwiVlBDIDEwLjAuMC4wLzIyXCIlMEEgICAgICAgICAgKyBcImNyZWF0ZWRfYnlcIiAgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0XCIlMEEgICAgICAgICAgKyBcImVudmlyb25tZW50XCIgPSBcInByb2R1Y3Rpb25cIiUwQSAgICAgICAgICArIFwibWFuYWdlbWVudFwiICA9IFwidHJ1ZVwiJTBBICAgICAgICAgICsgXCJzZXJ2aWNlXCIgICAgID0gXCJtYW5hZ2VtZW50XCIlMEEgICAgICAgIH0lMEEgICAgfSUwQSUwQVBsYW46IDI1IHRvIGFkZCwgMCB0byBjaGFuZ2UsIDAgdG8gZGVzdHJveS4lMEElMEFcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDBcdTI1MDAlMEElMEFTYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhbiUwQSUwQVRvIHBlcmZvcm0gZXhhY3RseSB0aGVzZSBhY3Rpb25zLCBydW4gdGhlIGZvbGxvd2luZyBjb21tYW5kIHRvIGFwcGx5OiUwQSAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCIlMEFSZWxlYXNpbmcgc3RhdGUgbG9jay4gVGhpcyBtYXkgdGFrZSBhIGZldyBtb21lbnRzLi4uJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDI1LCAiY2hhbmdlIjogMCwgImRlc3Ryb3kiOiAwfX0=```
</p></details>